import Link from 'next/link'

import { IconLink } from '@/components/IconLink'
import { Logo } from '@/components/Logo'
import { SignUpForm } from '@/components/SignUpForm'

function BookIcon(props) {
  return (
    <svg viewBox="0 0 16 16" aria-hidden="true" fill="currentColor" {...props}>
      <path d="M7 3.41a1 1 0 0 0-.668-.943L2.275 1.039a.987.987 0 0 0-.877.166c-.25.192-.398.493-.398.812V12.2c0 .454.296.853.725.977l3.948 1.365A1 1 0 0 0 7 13.596V3.41ZM9 13.596a1 1 0 0 0 1.327.946l3.948-1.365c.429-.124.725-.523.725-.977V2.017c0-.32-.147-.62-.398-.812a.987.987 0 0 0-.877-.166L9.668 2.467A1 1 0 0 0 9 3.41v10.186Z" />
    </svg>
  )
}

function NewspaperIcon(props) {
  return (
    <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
        <path fill-rule="evenodd" d="M2 3.5A1.5 1.5 0 013.5 2h9A1.5 1.5 0 0114 3.5v11.75A2.75 2.75 0 0016.75 18h-12A2.75 2.75 0 012 15.25V3.5zm3.75 7a.75.75 0 000 1.5h4.5a.75.75 0 000-1.5h-4.5zm0 3a.75.75 0 000 1.5h4.5a.75.75 0 000-1.5h-4.5zM5 5.75A.75.75 0 015.75 5h4.5a.75.75 0 01.75.75v2.5a.75.75 0 01-.75.75h-4.5A.75.75 0 015 8.25v-2.5z" clip-rule="evenodd" />
        <path d="M16.5 6.5h-1v8.75a1.25 1.25 0 102.5 0V8a1.5 1.5 0 00-1.5-1.5z" />
    </svg>
  )
}

function StarIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path fill-rule="evenodd" d="M10.868 2.884c-.321-.772-1.415-.772-1.736 0l-1.83 4.401-4.753.381c-.833.067-1.171 1.107-.536 1.651l3.62 3.102-1.106 4.637c-.194.813.691 1.456 1.405 1.02L10 15.591l4.069 2.485c.713.436 1.598-.207 1.404-1.02l-1.106-4.637 3.62-3.102c.635-.544.297-1.584-.536-1.65l-4.752-.382-1.831-4.401z" clip-rule="evenodd" />
        </svg>
    )
  }

  function BookmarkSquareIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path fill-rule="evenodd" d="M4.25 2A2.25 2.25 0 002 4.25v11.5A2.25 2.25 0 004.25 18h11.5A2.25 2.25 0 0018 15.75V4.25A2.25 2.25 0 0015.75 2H4.25zM6 13.25V3.5h8v9.75a.75.75 0 01-1.064.681L10 12.576l-2.936 1.355A.75.75 0 016 13.25z" clip-rule="evenodd" />
        </svg>
    )
  }

function FeedIcon(props) {
  return (
    <svg viewBox="0 0 16 16" aria-hidden="true" fill="currentColor" {...props}>
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M2.5 3a.5.5 0 0 1 .5-.5h.5c5.523 0 10 4.477 10 10v.5a.5.5 0 0 1-.5.5h-.5a.5.5 0 0 1-.5-.5v-.5A8.5 8.5 0 0 0 3.5 4H3a.5.5 0 0 1-.5-.5V3Zm0 4.5A.5.5 0 0 1 3 7h.5A5.5 5.5 0 0 1 9 12.5v.5a.5.5 0 0 1-.5.5H8a.5.5 0 0 1-.5-.5v-.5a4 4 0 0 0-4-4H3a.5.5 0 0 1-.5-.5v-.5Zm0 5a1 1 0 1 1 2 0 1 1 0 0 1-2 0Z"
      />
    </svg>
  )
}

function CheckIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path fill-rule="evenodd" d="M16.403 12.652a3 3 0 000-5.304 3 3 0 00-3.75-3.751 3 3 0 00-5.305 0 3 3 0 00-3.751 3.75 3 3 0 000 5.305 3 3 0 003.75 3.751 3 3 0 005.305 0 3 3 0 003.751-3.75zm-2.546-4.46a.75.75 0 00-1.214-.883l-3.483 4.79-1.88-1.88a.75.75 0 10-1.06 1.061l2.5 2.5a.75.75 0 001.137-.089l4-5.5z" clip-rule="evenodd" />
        </svg>
    )
}

function JoinIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path d="M11 5a3 3 0 11-6 0 3 3 0 016 0zM2.615 16.428a1.224 1.224 0 01-.569-1.175 6.002 6.002 0 0111.908 0c.058.467-.172.92-.57 1.174A9.953 9.953 0 018 18a9.953 9.953 0 01-5.385-1.572zM16.25 5.75a.75.75 0 00-1.5 0v2h-2a.75.75 0 000 1.5h2v2a.75.75 0 001.5 0v-2h2a.75.75 0 000-1.5h-2v-2z" />
        </svg>
    )
}

function PuzzleIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path d="M12 4.467c0-.405.262-.75.559-1.027.276-.257.441-.584.441-.94 0-.828-.895-1.5-2-1.5s-2 .672-2 1.5c0 .362.171.694.456.953.29.265.544.6.544.994a.968.968 0 01-1.024.974 39.655 39.655 0 01-3.014-.306.75.75 0 00-.847.847c.14.993.242 1.999.306 3.014A.968.968 0 014.447 10c-.393 0-.729-.253-.994-.544C3.194 9.17 2.862 9 2.5 9 1.672 9 1 9.895 1 11s.672 2 1.5 2c.356 0 .683-.165.94-.441.276-.297.622-.559 1.027-.559a.997.997 0 011.004 1.03 39.747 39.747 0 01-.319 3.734.75.75 0 00.64.842c1.05.146 2.111.252 3.184.318A.97.97 0 0010 16.948c0-.394-.254-.73-.545-.995C9.171 15.693 9 15.362 9 15c0-.828.895-1.5 2-1.5s2 .672 2 1.5c0 .356-.165.683-.441.94-.297.276-.559.622-.559 1.027a.998.998 0 001.03 1.005c1.337-.05 2.659-.162 3.961-.337a.75.75 0 00.644-.644c.175-1.302.288-2.624.337-3.961A.998.998 0 0016.967 12c-.405 0-.75.262-1.027.559-.257.276-.584.441-.94.441-.828 0-1.5-.895-1.5-2s.672-2 1.5-2c.362 0 .694.17.953.455.265.291.601.545.995.545a.97.97 0 00.976-1.024 41.159 41.159 0 00-.318-3.184.75.75 0 00-.842-.64c-1.228.164-2.473.271-3.734.319A.997.997 0 0112 4.467z" />
        </svg>
    )
}

function ChartBarIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path d="M15.5 2A1.5 1.5 0 0014 3.5v13a1.5 1.5 0 001.5 1.5h1a1.5 1.5 0 001.5-1.5v-13A1.5 1.5 0 0016.5 2h-1zM9.5 6A1.5 1.5 0 008 7.5v9A1.5 1.5 0 009.5 18h1a1.5 1.5 0 001.5-1.5v-9A1.5 1.5 0 0010.5 6h-1zM3.5 10A1.5 1.5 0 002 11.5v5A1.5 1.5 0 003.5 18h1A1.5 1.5 0 006 16.5v-5A1.5 1.5 0 004.5 10h-1z" />
        </svg>
    )
}

function MegaphoneIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path d="M13.92 3.845a19.361 19.361 0 01-6.3 1.98C6.765 5.942 5.89 6 5 6a4 4 0 00-.504 7.969 15.974 15.974 0 001.271 3.341c.397.77 1.342 1 2.05.59l.867-.5c.726-.42.94-1.321.588-2.021-.166-.33-.315-.666-.448-1.004 1.8.358 3.511.964 5.096 1.78A17.964 17.964 0 0015 10c0-2.161-.381-4.234-1.08-6.155zM15.243 3.097A19.456 19.456 0 0116.5 10c0 2.431-.445 4.758-1.257 6.904l-.03.077a.75.75 0 001.401.537 20.902 20.902 0 001.312-5.745 1.999 1.999 0 000-3.545 20.902 20.902 0 00-1.312-5.745.75.75 0 00-1.4.537l.029.077z" />
        </svg>
    )
}

function TelegramIcon(props) {
    return (
        <svg viewBox="0 0 20 20" aria-hidden="true" fill="currentColor" {...props}>
            <path fill-rule="nonzero" d="M2.98091938,8.76156605 C2.98091938,8.76156605 10.057334,5.85737275 12.5115819,4.83476948 C13.4523769,4.42572817 16.6428991,3.11679598 16.6428991,3.11679598 C16.6428991,3.11679598 18.1154478,2.54413815 17.9927354,3.9348786 C17.9518313,4.50753643 17.6245982,6.51183885 17.2973652,8.67975778 C16.8065156,11.7475676 16.2747619,15.1017063 16.2747619,15.1017063 C16.2747619,15.1017063 16.1929537,16.0425014 15.4975834,16.2061179 C14.8022132,16.3697344 13.6568975,15.63346 13.4523769,15.4698435 C13.2887604,15.3471311 10.3845671,13.5064452 9.32105967,12.6065544 C9.03473075,12.3611296 8.70749771,11.87028 9.3619638,11.2976222 C10.8345125,9.94778584 12.5933901,8.27071648 13.6568975,7.20720907 C14.1477471,6.7163595 14.6385967,5.57104383 12.5933901,6.96178429 C9.68919685,8.9660867 6.82590768,10.8476767 6.82590768,10.8476767 C6.82590768,10.8476767 6.17144159,11.256718 4.94431766,10.8885809 C3.71719373,10.5204437 2.28554915,10.0295941 2.28554915,10.0295941 C2.28554915,10.0295941 1.30385001,9.41603214 2.98091938,8.76156605 Z"></path>
        </svg>
    )
}

export function Intro() {
  return (
    <>
      <div>
        <Link href="/">
          <Logo className="inline-block h-8 w-auto" />
        </Link>
      </div>
      <h1 className="mt-14 font-display text-4xl/tight font-light text-white">
        Новые инвестиционные{' '}
        <span className="text-sky-300">возможности в Кыргызстане</span>
      </h1>
      <p className="mt-4 text-sm/6 text-gray-300">
        Кластер представляет собой объединение экономической деятельности юридических и физических лиц в различных отраслях. Целью такого объединения является совместная реализация конкурентных преимуществ определенной административно-территориальной единицы.
      </p>
      <SignUpForm />
      <div className="mt-8 flex flex-wrap justify-center gap-x-1 gap-y-3 sm:gap-x-2 lg:justify-start">
        <IconLink href="#цели-горного-кластера" icon={StarIcon} className="flex-none">
            Цели
        </IconLink>
        <IconLink href="#новые-инвестиционные-возможности-в-кыргызстане" icon={ChartBarIcon} className="flex-none">
            Инвестиционные возможности
        </IconLink>
        <IconLink href="#постановление-правительства" icon={BookmarkSquareIcon} className="flex-none">
            Декрет правительства
        </IconLink>
        <IconLink href="#" icon={JoinIcon} className="flex-none">
            Как присоединиться
        </IconLink>
      </div>
    </>
  )
}

export function IntroFooter() {
  return (
    <div className='flex gap-x-1 gap-y-3'>
        <p className="flex shrink-0 items-baseline gap-x-2 text-[0.8125rem]/6 text-gray-500">
            Присоединяйтесь к нашему{' '}
            <IconLink href="https://t.me/clusterkg" icon={TelegramIcon} compact large>
                телеграм-каналу
            </IconLink>
        </p>
        <IconLink href="/rss/feed.xml" icon={FeedIcon} className="flex-none">
          RSS
        </IconLink>
    </div>
  )
}
